[DIALOG_102]
BUTTON_1146=Config
BUTTON_1001=Test
BUTTON_1004=
DIALOG_TITLE=CalibrationTool for 3GR
LABEL_1005=SN Write:
LABEL_1006=
LABEL_1007=
LABEL_1008=WIFI Cal:
LABEL_1009=
LABEL_1010=RFC RFV:
LABEL_1011=
LABEL_1012=
LABEL_1013=
LABEL_1185=Pass:
LABEL_1186=Total:
LABEL_1181=MAC Write:
[DIALOG_129]
BUTTON_1014=AutoTest
BUTTON_1015=End if test failed
BUTTON_1017=...
BUTTON_1018=
BUTTON_1022=Input/Scan
BUTTON_1023=Auto
BUTTON_1026=DEC Carry
BUTTON_1027=HEX Carry
BUTTON_1028=Set Normal Mode
BUTTON_1060=2G850
BUTTON_1061=2G900
BUTTON_1062=2G1800
BUTTON_1063=2G1900
BUTTON_1064=3GBand1
BUTTON_1065=3GBand2
BUTTON_1066=3GBand5
BUTTON_1067=3GBand8
BUTTON_1068=Conventional Cal
BUTTON_1069=Fast Cal
BUTTON_1070=RF Verification
BUTTON_1071=
BUTTON_1072=
BUTTON_1073=Save
BUTTON_1074=Basic Setting:
BUTTON_1076=  SN Writing
BUTTON_1080=SN Segment:
BUTTON_1083=  WIFI Calibration
BUTTON_1107=  RF Calibration
BUTTON_1116=Forcing to write
BUTTON_1117=Cal Verification
BUTTON_1122=Write IMEI1
BUTTON_1123=Write IMEI2
BUTTON_1127=AFC
BUTTON_1128=  RF
BUTTON_1130=MeasCaleLoss
LABEL_1075=Log Path：
LABEL_1077=SN Length:
LABEL_1078=SN Prefix:
LABEL_1079=SN Suffix:
LABEL_1081=Start SN:
LABEL_1082=Total of SN:
LABEL_1084=EVMLimit1
LABEL_1085=EVMLimit2
LABEL_1086=EVMLimit3
LABEL_1087=EVMLimit4
LABEL_1088=EVMLimit5
LABEL_1089=EVMLimit6
LABEL_1090=EVMLimit7
LABEL_1091=EVMLimit8
LABEL_1092=EVMLimit9
LABEL_1093=EVMLimit10
LABEL_1094=FELossCH1
LABEL_1095=FELossCH2
LABEL_1096=FELossCH3
LABEL_1097=FELossCH4
LABEL_1098=FELossCH5
LABEL_1099=FELossCH6
LABEL_1100=FELossCH7
LABEL_1101=FELossCH8
LABEL_1102=FELossCH9
LABEL_1103=FELossCH10
LABEL_1104=FELossCH11
LABEL_1105=FELossCH12
LABEL_1106=FELossCH13
LABEL_1108=L850
LABEL_1109=L900
LABEL_1110=L1750
LABEL_1111=L1850
LABEL_1112=L1900
LABEL_1113=L1950
LABEL_1114=L2150
LABEL_1115=L2500
BUTTON_1125=Open
BUTTON_1187=Reboot
[DIALOG_134]
BUTTON_1129=  DeviceSN
BUTTON_1130=  WIFIMAC
BUTTON_1131=  BTMAC
BUTTON_1137=Forcing to write
BUTTON_1140=DEC Carry
BUTTON_1141=HEX Carry
BUTTON_1144=Forcing to write
BUTTON_1148=Forcing to write
BUTTON_1150=Segment
BUTTON_1153=  IMEI
BUTTON_1155=Segment
BUTTON_1156=Segment
LABEL_1157=Start:
LABEL_1158=Start:
LABEL_1161=Total:
LABEL_1159=Start1:
LABEL_1160=Start2:
LABEL_1162=Total:
LABEL_1163=Total1:
LABEL_1164=Total2:
LABEL_1077=SNLength:
LABEL_1078=SNPrefix:
LABEL_1079=SNSuffix:
LABEL_1080=Segment
LABEL_1081=Start:
LABEL_1082=Total:
BUTTON_1165=Input/Scan
BUTTON_1166=Auto
BUTTON_1167=Input/Scan
BUTTON_1168=Auto
BUTTON_1169=Input/Scan
BUTTON_1170=Auto
[PROMPT]
DIALOG_ALLCONFIG=Config Window
IDS_ERROR_CAPTION=ERROR
IDS_INFO_CAPTION=INFO
IDS_TEXT_SNDLG_CAPTION=SN Window
IDS_TEXT_PWDDLG_CAPTION=Password Window
IDS_TEXT_SHOW_PWD=Show Password
IDS_TEXT_OK=OK
IDS_TEXT_ON=ON
IDS_TEXT_OFF=OFF
IDS_TEXT_CABLELOSS=Meas CableLoss
IDS_TEXT_TEST=Test...
IDS_TEXT_SUCCESS=Pass
IDS_TEXT_WARNING=Warning
IDS_TEXT_FAIL=Fail
IDS_TEXT_CANCEL=Cancel
IDS_TEXT_TEST_BUTTON=Test
IDS_TEXT_STOP_BUTTON=Stop
IDS_TEXT_STOPING_BUTTON=Stop...
IDS_INFO_CONFIG_OK=Saving config succeeded.

IDS_ERROR_WIFI_EVMLIMIT=Value of EVMLIMIT%d is invalid!
IDS_ERROR_WIFI_FELOSSCH=Value of FELossCH%d is invalid!
IDS_ERROR_RF_ATTENUATION=Value of RF attenuation is invalid!
IDS_ERROR_NO_TEST_ITEM=None of test item was selected!
IDS_ERROR_STILL_RUNNING=Test is still running,please wait!
IDS_ERROR_NO_DEVICE=No found any device to test!
IDS_ERROR_IPCS_DLL=Loading libipcs.dll failed!
IDS_ERROR_ENGINE_DLL=Loading engine.dll failed!
IDS_ERROR_NO_TEST=Nothing to do !
IDS_ERROR_RF_NO_BAND=None of test item is checked in rf test!
IDS_ERROR_RF_XML=XML file of rf is not exist!
IDS_ERROR_RUN_OUT_OF_SN=None of sn is available in the current segment of sn,please set a new one!
IDS_INFO_CONN_DEVICE=Connecting to device(Com=%d)...
IDS_INFO_CONN_PASS=Connecting to device pass
IDS_ERROR_CONN_FAIL=Connecting to device failed
IDS_INFO_CHECK_ROUT=检查SN站别信息...
IDS_INFO_CHECK_ROUT_ERR=站别信息不匹配
IDS_CHECK_SNROUTE_ERR=检查SN站别信息失败
IDS_INFO_CHECK_ROUT_SUCCESS=SN站别信息匹配
IDS_INFO_SN_WRITE=Writing sn...
IDS_INFO_SN_PASS=Writing sn pass
IDS_ERROR_SN_FAIL=Writing sn failed
IDS_ERROR_SN_NO_INPUT=User did not input sn!
IDS_ERROR_SN_INVALID_PREFIX=Checking prefix of sn failed!
IDS_ERROR_SN_INVALID_SUFFIX=Checking suffix of sn failed!

IDS_INFO_MAC_WRITE=Writing MAC...
IDS_INFO_MAC_PASS=Write MAC successfully
IDS_ERROR_MAC_FAIL=Write MAC Failed
IDS_INFO_WIFI_CAL=Doing wifi self-calibration...
IDS_INFO_WIFI_PASS=Wifi self-calibration pass
IDS_ERROR_WIFI_FAIL=Wifi self-calibration failed
IDS_ERROR_WIFI_FAIL_RETRY=Wifi self-calibration failed,retry
IDS_ERROR_WIFI_RESULT_COMMIT_FAIL=Commiting result of wifi self-calibration failed

IDS_INFO_RF_CAL=RF(%s)...
IDS_INFO_RF_BAND=RF Band(%s)
IDS_ERROR_RF_GET_AT_FAIL=No found AT port
IDS_INFO_RF_AT=RF(AT=COM%d)

IDS_INFO_RF_PASS=RF(%s) pass
IDS_INFO_RF_CONFIG_BAND=Setting band of rf...
IDS_INFO_RF_CONFIG_BAND_PASS=Setting band of rf pass
IDS_ERROR_RF_FAIL=RF(%s) failed
IDS_ERROR_RF_CONFIG_BAND_FAIL=Setting band of rf failed
IDS_INFO_RF_RESULT_COMMIT=Commiting result of rf(%s)...
IDS_INFO_RF_RESULT_COMMIT_PASS=Commiting result of rf(%s) pass
IDS_ERROR_RF_RESULT_COMMIT_FAIL=Commiting result of rf(%s) failed
IDS_ERROR_WRITE_IMEI_FAIL =Write IMEI failed
IDS_ERROR_WRITE_IMEI_PASS =Write IMEI success
IDS_INFO_SET_NORMAL=Setting normal-mode...
IDS_INFO_SET_NORMAL_PASS=Setting normal-mode pass
IDS_ERROR_SET_NORMAL_FAIL=Setting normal-mode failed
IDS_INFO_ALL_TEST_PASS= All of test pass
IDS_INFO_UPLOAD_RESULT=Upload test results successfully
IDS_INFO_UPLOAD_RESULT=上传测试结果..
IDS_INFO_UPLOAD_FAIL=上传测试结果失败
IDS_INFO_UPLOAD_INFO_FAIL=上传测试结果信息错误
IDS_INFO_UPLOAD_SUCESS=上传测试结果成功
IDS_INFO_TIME_ELAPSE=Elapse %d'%d seconds

IDS_ERROR_OUT_OF_PCBSN= None of Pcb SN is available in the current segment of sn,please set a new one!
IDS_ERROR_OUT_OF_DEVSN=None of Device SN is available in the current segment of sn,please set a new one!
IDS_ERROR_OUT_OF_WIFIMAC=None of WIFI MAC is available in the current segment of sn,please set a new one!
IDS_ERROR_OUT_OF_BTMAC=None of BT MAC is available in the current segment of sn,please set a new one!

IDS_INFO_ABORT=User Abort Input
IDS_INFO_FORMAT_ERROR=%s Format Incalid
IDS_INFO_SECOND_EXIT=%d seconds after will auto abort
IDS_INFO_CC=Conventional Cal
IDS_INFO_FC=Fast Cal
IDS_INFO_CV=Cal Verification
IDS_INFO_RV=RF Verification
IDS_INFO_SS_SKIP=%s is exist,skip of writing
IDS_INFO_SS_WRITE=Writing %s...
IDS_INFO_SS_PASS=Write %s successfully
IDS_ERROR_SS_LENGTH=Length of %s is invalid!
IDS_ERROR_SS_CARRY_LENGTH=Length of Prefix and Suffix is longer than %s!
IDS_ERROR_SS_SEGMENT_START=Start %s is invalid in sn segment!
IDS_ERROR_SS_SEGMENT_TOTAL=Value of total is invalid in %s segment!
IDS_TOOL_ENABLE=Hand shak...
IDS_TOOL_ENABLE_SUCCESS=Hand shake pass
IDS_TOOL_ENABLE_FAILED=Hand shake fail
IDS_BAND_SET_ERROR=Calibration Band mismatch
IDS_ERROR_MOPTEST=Device no in PTEST mode，can not do calibration
IDS_INFO_MOPTEST=Device in PTEST mode 
IDS_INFO_COMMIT_NVM_FAIL=Store NVM data fail
IDS_INFO_COMMIT_NVM_PASS=Store NVM data pass
IDS_INFO_COMMIT_NVM=Store NVM data
IDS_INFO_REBOOT=Rebooting
IDS_ERROR_CABLELOSS_DLL=Loading meas.dll failed!
IDS_INFO_MEAS_START=Measure start...
IDS_INFO_MEAS_BAND=RF Band(%s)
IDS_ERROR_MEAS_GET_AT_FAIL=No found AT port
IDS_INFO_MEAS_AT=Measure cable(AT=COM%d)
IDS_INFO_MEAS_PASS=Measure cable loss pass
IDS_INFO_MEAS_TIME_ELAPSE=Elapse %d'%d seconds
IDS_INFO_MEAS_PASS=Measure finished
IDS_INFO_USER_ABORT=User abort operation
IDS_INFO_WAIT_REBOOT=Wait for device reboot...
IDS_INFO_REMOVE_FAIL=Device reboot fail，please remove device 
IDS_INFO_REMOVE_PASS=Device reboot pass，please remove device
IDS_INFO_NOTIFY=Notify？
IDS_INFO_MEAS_OK=Please make sure the device used measure cable loss has been calibration!!!
IDS_INFO_STATISTICS_WARNING=Test log statistics may take some time depending on log file counts, continue?
IDS_ERROR_STATISTICS=Statistics fail!!!
IDS_INFO_STATISTICS_OK=Statistics OK！！！
IDS_INFO_OK=OK
IDS_INFO_NO=No
IDS_INFO_YES=Yes
MENU_0=Settings
MENU_0_0=Config
MENU_0_1=StressTest
MENU_0_1_0=Enable
MENU_0_1_1=PowerSetting
MENU_0_2=DeviceType
MENU_0_2_0=Sofia3gr
MENU_0_2_1=XMM6321
MENU_0_2_2=WifiOnly
MENU_0_2_3=Auto
MENU_1=Help
MENU_1_0=Open log
MENU_1_0_0=Text
MENU_1_0_1=Html
MENU_1_1=Open Log Folder
MENU_1_2=Reset Count
MENU_1_3=statistics